[
  {
    "title":"All-Pairs Shortest-Paths for Large Graphs on the GPU (10 year TEST OF TIME AWARD)",
    "link":"https://dl.acm.org/citation.cfm?id=1413966",
    "authors":"Gary Katz and Joseph T. Kider Jr",
    "conference":"Graphics Hardware",
    "year":"2008"
  },
  {
    "title":"Recreating Early Islamic Glass Lamp Lighting (BEST PAPER AWARD)",
    "link":"https://repository.upenn.edu/cgi/viewcontent.cgi?article=1629&context=cis_papers",
    "authors":"Joseph T. Kider Jr., Rebecca L. Fletcher, Nancy Yu, Renata Holod, Alan Chalmers, and Norman I. Badler",
    "conference":"International Symposium on Virtual Reality, Archaeology and Cultural Heritage (VAST)",
    "year":"2009"
  },
  {
    "title":"Real-time Evacuation Simulation in Mine Interior Model of Smoke and Action",
    "link":"https://repository.upenn.edu/cgi/viewcontent.cgi?article=1241&context=hms",
    "authors":"Pengfei. Huang, Jinsheng Kang, Joseph T. Kider Jr., Benjamin Sunshine-Hill, Jon McCaffrey, Desiree Rios, Norman Badler",
    "conference":"Computer Animation and Social Agents",
    "year":"2010"
  },
  {
    "title":"High-dimensional Planning on the GPU",
    "link":"http://ieeexplore.ieee.org/document/5509470/",
    "authors":"Joseph T. Kider, Mark Henderson, Maxim Likhachev, Alla Safonova",
    "conference":"IEEE International Conference on Robotics and Automation (ICRA)",
    "year":"2010"
  },
  {
    "title":"CRAM it! A Comparison of Virtual, Live-Action and Written Training Systems for Preparing Personnel to Work in Hazardous Environments",
    "link":"https://ieeexplore.ieee.org/document/5759444/",
    "authors":"Catherine Stocker, Ben Sunshine-Hill, John Drake, Ian Perera, Joseph T. Kider Jr., Norman I. Badler",
    "conference":"IEEE International Conference on Virtual Reality (VR)",
    "year":"2011"
  },
  {
    "title":"Human Model Reaching, Grasping, Looking and Sitting using Smart Objects",
    "link":"https://repository.upenn.edu/cgi/viewcontent.cgi?article=1619&context=cis_papers",
    "authors":"Damian Slonneger, Matthew Croop, Jeremy Cytryn, Joseph T. Kider Jr.,Richard Rabbitz, Eric Halpern, Norman I. Badler",
    "conference":"International Symposium on Digital Human Modeling (DHM)",
    "year":"2011"
  },
  {
    "title":"Intelligent Camera Control using Behavior Trees",
    "link":"https://link.springer.com/chapter/10.1007/978-3-642-25090-3_1",
    "authors":"Daniel Markowitz, Joseph T. Kider Jr., Alexander Shoulson, and Norman I. Badler",
    "conference":"Motion in Games (MIG)",
    "year":"2011"
  },
  {
    "title":"A Data-driven Appearance Model for Human Fatigue (HONORABLE MENTION AWARD)",
    "link":"https://dl.acm.org/citation.cfm?id=2019423",
    "authors":"Joseph T. Kider Jr, Kaitlin Pollock, and Alla Safonova",
    "conference":"SIGGRAPH/ Eurographics Symposium on Computer Animation (SCA)",
    "year":"2011"
  },
  {
    "title":"Fruit Senescence and Decay Simulation",
    "link":"https://diglib.eg.org/handle/10.1111/v30i2pp257-266",
    "authors":"Joseph T. Kider Jr, Samantha Raja, and Norman I. Badler",
    "conference":"Eurographics",
    "year":"2011"
  },
  {
    "title":"Efficient Motion Retrieval in Large Motion Databases",
    "link":"https://dl.acm.org/citation.cfm?id=2448199",
    "authors":"Mubbasir Kapadia, I-kao Chiang, Tiju Thomas, Norman I. Badler, Joseph T. Kider Jr.",
    "conference":"Interactive 3d Graphics and Games (I3D)",
    "year":"2012"
  },
  {
    "title":"A Framework for the Experimental Comparison of Solar and Skydome Illumination",
    "link":"https://dl.acm.org/citation.cfm?id=2661259",
    "authors":"Joseph T. Kider Jr., Daniel Knowlton, Jeremy Newlin, Yining Karl Li, and Donald P. Greenberg",
    "conference":"ACM Transactions on Graphics (SIGGRAPH ASIA)",
    "year":"2014"
  },
  {
    "title":"Accurate Soil and Mudbrick BRDF Models for Archaeological Illumination Rendering with Application to Small Finds",
    "link":"https://diglib.eg.org/handle/10.2312/gch20171289",
    "authors":"Virgina Badler, Joseph T. Kider Jr , Megan Moore, Bruce Walter, Norman I. Badler",
    "conference":"EUROGRAPHICS Workshop on Graphics and Cultural Heritage (GCH)",
    "year":"2017"
  },
  {
    "title":"RoMA Interactive Fabrication with Augmented Reality and a Robotic 3D Printer",
    "link":"https://dl.acm.org/citation.cfm?id=3174153",
    "authors":"Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph T. Kider Jr., Stefanie Mueller, Patrick Baudisch, François Guimbretière",
    "conference":"Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18)",
    "year":"2018"
  },
  {
    "title":"Temporal IR Energy Maps for Synthetic Virtual Training",
    "link":"https://www.josephkider.com/data/publications/2018-IITSEC-TEMs.pdf",
    "authors":"Joseph T. Kider Jr., Mark Faulk, Ron Moore, Julian Barriga, Jerred Holt",
    "conference":"Interservice/Industry Training, Simulation, and Education Conference (I/ITSEC) ",
    "year":"2018"
  },
  {
    "title":"Modeling and Simulation of Parametric Wind-Catcher Designs for Natural Ventilation in Sustainable Building Skin Architecture",
    "link":"https://www.josephkider.com/data/publications/2018-AdvancedBuildSkins-ParametricNV.pdf",
    "authors":"Arash Zarmehr, Joseph T. Kider Jr.",
    "conference":"Advanced Building Skins (ABS)",
    "year":"2018"
  },
  {
    "title":"An affective kinetic building facade system - Mood Swing",
    "link":"https://www.josephkider.com/data/publications/2018-AdvancedBuildSkins-MoodSwing.pdf",
    "authors":"Nathan Moulton, Joseph Del Rocco, Joseph T. Kider Jr., Stephen M. Fiore",
    "conference":"Advanced Building Skins (ABS)",
    "year":"2018"
  },
  {
    "title":"Learning and estimating whole sky visible, VNIR, SWIR radiance distributions from a commercial camera",
    "link":"https://spie.org/Publications/Proceedings/Paper/10.1117/12.2321295?SSO=1",
    "authors":"Joseph Del Rocco, Charles Brandon Patterson, Hassen Dhrif, Joseph T. Kider Jr.",
    "conference":"SPIE Optics and Photonics for Information Processing XII",
    "year":"2018"
  },
  {
    "title":"Robust Path Matching and Anomalous Route Detection Using Posterior Weighted Graphs",
    "link":"https://dl.acm.org/citation.cfm?id=3338905",
    "authors":"Lauren Doocy, Steven D. Prager, Joseph T. Kider Jr., R. Paul Wiegand",
    "conference":"ACM Transactions on Spatial Algorithms and Systems (TSAS)",
    "year":"2019"
  },
  {
    "title":"Transition Portal for daylighting calculations in early phase design",
    "link":"https://www.sciencedirect.com/science/article/pii/S0378778818328421",
    "authors":"Joseph T. Kider Jr., Bruce Walter, Sandy Fang, Ege Sekkin, Donald P. Greenberg",
    "conference":"Energy and Buildings",
    "year":"2019"
  },
  {
    "title":"Simulation Analysis of a Ventilated Building Integrated-Photovoltaics Air-Gap Duct System for Natural Ventilation of a Building",
    "link":"http://buildingsimulation2019.org",
    "authors":"Arash Zarmehr, Joseph T. Kider Jr.",
    "conference":"Building Simulation",
    "year":"2019"
  }
]